# Pandas I

For Intermediate Python module

# 1)- Importing key libraries

In [1]:
#support both Python 2 and Python 3 with minimal overhead.
from __future__ import absolute_import, division, print_function

In [2]:
# I am an engineer. I care only about error not warning. So, let's be maverick and ignore warnings.
import warnings
warnings.filterwarnings('ignore')

In [3]:
# What's life without style :). So, let's add style to our dataframes
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [4]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [5]:
# first install: pip install version_information
%reload_ext version_information
%version_information math, numpy, sys, platform

Software versions
Python 3.6.5 64bit [MSC v.1900 64 bit (AMD64)]
IPython 6.4.0
OS Windows 10 10.0.18362 SP0
math The 'math' distribution was not found and is required by the application
numpy 1.16.0
sys The 'sys' distribution was not found and is required by the application
platform 1.0.8
Sat Aug 17 19:23:31 2019 W. Europe Daylight Time

In [6]:
%reload_ext version_information
%version_information numpy, pandas, matplotlib

Software versions
Python 3.6.5 64bit [MSC v.1900 64 bit (AMD64)]
IPython 6.4.0
OS Windows 10 10.0.18362 SP0
numpy 1.16.0
pandas 0.24.1
matplotlib 3.0.2
Sat Aug 17 19:23:31 2019 W. Europe Daylight Time

# 1) Pandas

### 1.1)- Series

In [7]:
# a list of strings
my_list = ['cubs', 'pirates', 'giants', 'yankees', 'donkeys']
my_list

['cubs', 'pirates', 'giants', 'yankees', 'donkeys']

In [8]:
# pandas Series from list
series_from_list = pd.Series(my_list)
series_from_list

0       cubs
1    pirates
2     giants
3    yankees
4    donkeys
dtype: object

In [9]:
# indexing a Series is similar to lists and arrays
series_from_list[3]

'yankees'

In [10]:
# a numpy array
my_array = np.random.rand(5)
my_array

array([0.5446338 , 0.32060946, 0.63349996, 0.72720023, 0.53631343])

In [11]:
# pandas Series from array
series_from_array = pd.Series(my_array)
series_from_array

0    0.544634
1    0.320609
2    0.633500
3    0.727200
4    0.536313
dtype: float64

In [12]:
type(series_from_array)

pandas.core.series.Series

In [13]:
# indexing supports lists
series_from_array[[1, 3]]

1    0.320609
3    0.727200
dtype: float64

In [14]:
# indexing supports slices
series_from_array[3:]

3    0.727200
4    0.536313
dtype: float64

### 1.2)-DataFrame

**2D array to DataFrame**

In [15]:
my_2d_array = np.random.randn(5,5)
my_2d_array

array([[ 0.82156833, -0.71570628, -0.82611028, -0.6999713 ,  0.9424657 ],
       [ 2.364633  ,  0.92538147,  0.76299085,  1.72689244, -0.6833483 ],
       [ 2.20274583,  0.73228696, -0.98100789,  1.37033512, -0.05257998],
       [ 0.00334947, -1.78152296, -1.34039781, -0.1822903 ,  1.16585653],
       [ 0.21041609,  0.70015367, -0.35533725,  0.06658628, -0.41475256]])

In [16]:
# make a DataFrame from the 2D numpy array
pd.DataFrame(my_2d_array)

          0         1         2         3         4
0  0.821568 -0.715706 -0.826110 -0.699971  0.942466
1  2.364633  0.925381  0.762991  1.726892 -0.683348
2  2.202746  0.732287 -0.981008  1.370335 -0.052580
3  0.003349 -1.781523 -1.340398 -0.182290  1.165857
4  0.210416  0.700154 -0.355337  0.066586 -0.414753

In [17]:
# we can set the index and column labels when we create the DataFrame
# note that we can combine positional arguments (data) and keyword arguments
# (index, columns) as long as positional arguments come first
df_from_2d_array = pd.DataFrame(
    my_2d_array,
    index=['row1', 'row2', 'row3', 'row4', 'row5'],
    columns=['col1', 'col2', 'col3', 'col4', 'col5'])
df_from_2d_array

          col1      col2      col3      col4      col5
row1  0.821568 -0.715706 -0.826110 -0.699971  0.942466
row2  2.364633  0.925381  0.762991  1.726892 -0.683348
row3  2.202746  0.732287 -0.981008  1.370335 -0.052580
row4  0.003349 -1.781523 -1.340398 -0.182290  1.165857
row5  0.210416  0.700154 -0.355337  0.066586 -0.414753

In [18]:
type(df_from_2d_array)

pandas.core.frame.DataFrame

In [19]:
# also note that commas and brackets/parentheses can precede a newline in python code
mylist = [
    0, 2, 4,
    6, 8, 10]

In [20]:
mylist

[0, 2, 4, 6, 8, 10]

**Converting multiple Series to a DataFrame**

In [21]:
x = pd.DataFrame(data=[series_from_list, series_from_array])
x

          0         1       2        3         4
0      cubs   pirates  giants  yankees   donkeys
1  0.544634  0.320609  0.6335   0.7272  0.536313

In [22]:
# note that each column has dtype object (string)
x.dtypes

0    object
1    object
2    object
3    object
4    object
dtype: object

In [23]:
x = x.transpose()
x

         0         1
0     cubs  0.544634
1  pirates  0.320609
2   giants    0.6335
3  yankees    0.7272
4  donkeys  0.536313

In [24]:
x.dtypes

0    object
1    object
dtype: object

In [25]:
# method 2: pass list/Series as value of dictionary
y = pd.DataFrame({'a': series_from_list, 'b': series_from_array})
y

         a         b
0     cubs  0.544634
1  pirates  0.320609
2   giants  0.633500
3  yankees  0.727200
4  donkeys  0.536313

In [26]:
y.dtypes

a     object
b    float64
dtype: object

In [27]:
# method 3: use pd.concat to combine series in column orientation
df = pd.concat([series_from_list, series_from_array], axis=1)
df

         0         1
0     cubs  0.544634
1  pirates  0.320609
2   giants  0.633500
3  yankees  0.727200
4  donkeys  0.536313

In [28]:
df.dtypes

0     object
1    float64
dtype: object

### 1.3)-index, columns

In [29]:
# numeric indexes
df.index

RangeIndex(start=0, stop=5, step=1)

In [30]:
# numeric column names
df.columns

RangeIndex(start=0, stop=2, step=1)

In [31]:
df.index = ['a', 'b', 'c', 'd', 'e']
df.columns = ['team', 'random']
df

      team    random
a     cubs  0.544634
b  pirates  0.320609
c   giants  0.633500
d  yankees  0.727200
e  donkeys  0.536313

In [32]:
# label (object) indexes
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [33]:
# label (object) column names
df.columns

Index(['team', 'random'], dtype='object')

In [34]:
# add a new column to the end of a DataFrame
df['integers'] = [2, 3, 5, 8, 13]
df

      team    random  integers
a     cubs  0.544634         2
b  pirates  0.320609         3
c   giants  0.633500         5
d  yankees  0.727200         8
e  donkeys  0.536313        13

In [35]:
# add a new column at a specific position
df.insert(0, 'integers2', [2, 3, 5, 8, 13])
df

   integers2     team    random  integers
a          2     cubs  0.544634         2
b          3  pirates  0.320609         3
c          5   giants  0.633500         5
d          8  yankees  0.727200         8
e         13  donkeys  0.536313        13

In [36]:
# delete a column
df.drop('integers2', axis=1, inplace=True)
df

      team    random  integers
a     cubs  0.544634         2
b  pirates  0.320609         3
c   giants  0.633500         5
d  yankees  0.727200         8
e  donkeys  0.536313        13

In [37]:
# rename columns - method 2
# using dictionary mapping old names to new names
df.rename(columns={'integers': 'fibonacci'}, inplace=True)
df

      team    random  fibonacci
a     cubs  0.544634          2
b  pirates  0.320609          3
c   giants  0.633500          5
d  yankees  0.727200          8
e  donkeys  0.536313         13

In [38]:
# reorder the columns by passing a list of columns in the desired order
df[['fibonacci', 'team', 'random']]

   fibonacci     team    random
a          2     cubs  0.544634
b          3  pirates  0.320609
c          5   giants  0.633500
d          8  yankees  0.727200
e         13  donkeys  0.536313

### 1.4)-dtypes, info, describe

In [39]:
# gives the datatype of each column
df.dtypes

team          object
random       float64
fibonacci      int64
dtype: object

In [40]:
# shape (dimensions) of dataframe
df.shape

(5, 3)

In [41]:
# information about index and columns
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, a to e
Data columns (total 3 columns):
team         5 non-null object
random       5 non-null float64
fibonacci    5 non-null int64
dtypes: float64(1), int64(1), object(1)
memory usage: 160.0+ bytes

In [42]:
# basic statistics
df.describe()

         random  fibonacci
count  5.000000   5.000000
mean   0.552451   6.200000
std    0.150979   4.438468
min    0.320609   2.000000
25%    0.536313   3.000000
50%    0.544634   5.000000
75%    0.633500   8.000000
max    0.727200  13.000000

### 1.5)- Reading files

In [43]:
df_sio = pd.read_csv('scripps_pier_20151110.csv')
df_sio.shape

(66, 5)

In [44]:
df.head()

      team    random  fibonacci
a     cubs  0.544634          2
b  pirates  0.320609          3
c   giants  0.633500          5
d  yankees  0.727200          8
e  donkeys  0.536313         13

In [45]:
df_sio.dtypes

Date            object
chl (ug/L)     float64
pres (dbar)    float64
sal (PSU)      float64
temp (C)       float64
dtype: object

In [46]:
df_sio.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 66 entries, 0 to 65
Data columns (total 5 columns):
Date           66 non-null object
chl (ug/L)     66 non-null float64
pres (dbar)    66 non-null float64
sal (PSU)      66 non-null float64
temp (C)       66 non-null float64
dtypes: float64(4), object(1)
memory usage: 2.7+ KB

In [47]:
df_sio.describe()

       chl (ug/L)  pres (dbar)  sal (PSU)  temp (C)
count   66.000000    66.000000  66.000000  66.00000
mean    22.349576     3.041818  33.199318  20.06697
std      0.038988     0.254295   0.004959   0.06850
min     22.305000     2.714000  33.184000  19.94000
25%     22.319000     2.813250  33.197000  20.04000
50%     22.333500     2.997000  33.199000  20.07000
75%     22.385000     3.215500  33.203000  20.10500
max     22.426000     3.712000  33.206000  20.19000

In [48]:
df_sio2 = pd.read_csv('scripps_pier_20151110.csv', 
                     dtype=object, index_col=None, header=0)

In [49]:
df_sio2.shape

(66, 5)

In [50]:
df_sio2.dtypes

Date           object
chl (ug/L)     object
pres (dbar)    object
sal (PSU)      object
temp (C)       object
dtype: object

In [51]:
df_sio3 = pd.read_csv('scripps_pier_20151110.csv',
                      dtype={'pres (dbar)': np.float64, 'temp (C)': str}, 
                      index_col=None, header=0)

In [52]:
df_sio3.dtypes

Date            object
chl (ug/L)     float64
pres (dbar)    float64
sal (PSU)      float64
temp (C)        object
dtype: object

**Changing dtype of columns after DataFrame is created**

In [53]:
# method 1: list comprehension (one column)
df_sio['chl (ug/L)'] = [float(x) for x in df_sio['chl (ug/L)']]

In [54]:
# method 2: pd.to_numeric (one column)
df_sio['pres (dbar)'] = pd.to_numeric(df_sio['pres (dbar)'])

In [55]:
# method 3: apply(pd.to_numeric) (multiple columns)
df_sio[['sal (PSU)','temp (C)']] = df_sio[['sal (PSU)','temp (C)']].apply(pd.to_numeric)

In [56]:
df_sio.dtypes

Date            object
chl (ug/L)     float64
pres (dbar)    float64
sal (PSU)      float64
temp (C)       float64
dtype: object

In [57]:
df_sio.head(3)

            Date  chl (ug/L)  pres (dbar)  sal (PSU)  temp (C)
0  11/10/15 1:42      22.307        3.712     33.199     19.95
1  11/10/15 1:35      22.311        3.588     33.201     19.94
2  11/10/15 1:29      22.305        3.541     33.200     19.95

# 2)- Indexing with bracket/dot notation


loc, iloc

In [58]:
df

      team    random  fibonacci
a     cubs  0.544634          2
b  pirates  0.320609          3
c   giants  0.633500          5
d  yankees  0.727200          8
e  donkeys  0.536313         13

In [59]:
# to get a column (Series), use the column header (don't need .loc, .iloc, or .ix)
df['team']

a       cubs
b    pirates
c     giants
d    yankees
e    donkeys
Name: team, dtype: object

In [60]:
# for multiple columns, put a list inside the brackets (so two sets of brackets)
df[['team', 'random']]

      team    random
a     cubs  0.544634
b  pirates  0.320609
c   giants  0.633500
d  yankees  0.727200
e  donkeys  0.536313

### 2.1)- dot-notation

In [61]:
# if the column name has only alpha-numerics (including underscores), 
# we can use a dot instead of brackets and quotes
df.team

a       cubs
b    pirates
c     giants
d    yankees
e    donkeys
Name: team, dtype: object

### 2.2)-loc -- row by index

In [62]:
# to get a row by name, use .loc with the row index
df.loc['a']

team             cubs
random       0.544634
fibonacci           2
Name: a, dtype: object

In [63]:
# for multiple rows, put a list inside the brackets (so two sets of brackets)
df.loc[['a', 'd']]

      team    random  fibonacci
a     cubs  0.544634          2
d  yankees  0.727200          8

### 2.3)-iloc

row (or column) by position

In [64]:
# to get a row by position, use .iloc with the row number
df.iloc[0]

team             cubs
random       0.544634
fibonacci           2
Name: a, dtype: object

In [65]:
# for multiple rows, put a list inside the brackets (so two sets of brackets)
df.iloc[[0, 3]]

      team    random  fibonacci
a     cubs  0.544634          2
d  yankees  0.727200          8

In [66]:
# or pass a slice
df.iloc[2:]

      team    random  fibonacci
c   giants  0.633500          5
d  yankees  0.727200          8
e  donkeys  0.536313         13

In [67]:
# iloc also works with columns
df.iloc[:, [0, 2]]

      team  fibonacci
a     cubs          2
b  pirates          3
c   giants          5
d  yankees          8
e  donkeys         13

### 2.4)-transpose

In [68]:
df

      team    random  fibonacci
a     cubs  0.544634          2
b  pirates  0.320609          3
c   giants  0.633500          5
d  yankees  0.727200          8
e  donkeys  0.536313         13

In [69]:
df.transpose()

                  a         b       c        d         e
team           cubs   pirates  giants  yankees   donkeys
random     0.544634  0.320609  0.6335   0.7272  0.536313
fibonacci         2         3       5        8        13

In [70]:
df.T

                  a         b       c        d         e
team           cubs   pirates  giants  yankees   donkeys
random     0.544634  0.320609  0.6335   0.7272  0.536313
fibonacci         2         3       5        8        13

### 2.5)- Saving file

As to_csv, to_excel

In [71]:
# to_csv with defaults (sep=',')
df.to_csv('teams.csv')

In [72]:
df_team = pd.read_csv('teams.csv')
df_team.shape

(5, 4)

In [73]:
df_team

  Unnamed: 0     team    random  fibonacci
0          a     cubs  0.544634          2
1          b  pirates  0.320609          3
2          c   giants  0.633500          5
3          d  yankees  0.727200          8
4          e  donkeys  0.536313         13

In [74]:
# use the sep option if the separator is not a comma
df.to_csv('teams.tsv', sep='\t')

In [75]:
df_team = pd.read_csv('teams.csv')
df_team.shape

(5, 4)

In [76]:
df_team

  Unnamed: 0     team    random  fibonacci
0          a     cubs  0.544634          2
1          b  pirates  0.320609          3
2          c   giants  0.633500          5
3          d  yankees  0.727200          8
4          e  donkeys  0.536313         13

In [77]:
# with index label
df.to_csv('teams.csv', index_label='index')

In [78]:
df_team = pd.read_csv('teams.csv')
df_team.shape

(5, 4)

In [79]:
df_team

  index     team    random  fibonacci
0     a     cubs  0.544634          2
1     b  pirates  0.320609          3
2     c   giants  0.633500          5
3     d  yankees  0.727200          8
4     e  donkeys  0.536313         13

In [80]:
# to_excel requires the openpyxl package
df.to_excel('teams.xlsx', index_label='index')

In [81]:
df_team = pd.read_excel('teams.xlsx')
df_team

  index     team    random  fibonacci
0     a     cubs  0.544634          2
1     b  pirates  0.320609          3
2     c   giants  0.633500          5
3     d  yankees  0.727200          8
4     e  donkeys  0.536313         13

# 3)-Time Series

to_datetime

In [82]:
df_sio.head()

            Date  chl (ug/L)  pres (dbar)  sal (PSU)  temp (C)
0  11/10/15 1:42      22.307        3.712     33.199     19.95
1  11/10/15 1:35      22.311        3.588     33.201     19.94
2  11/10/15 1:29      22.305        3.541     33.200     19.95
3  11/10/15 1:23      22.323        3.463     33.200     19.95
4  11/10/15 1:17      22.316        3.471     33.199     19.95

In [83]:
df_sio.dtypes

Date            object
chl (ug/L)     float64
pres (dbar)    float64
sal (PSU)      float64
temp (C)       float64
dtype: object

### 3.1)-Convert datetime

In [84]:
time = pd.to_datetime(df_sio['Date'])
time.head()

0   2015-11-10 01:42:00
1   2015-11-10 01:35:00
2   2015-11-10 01:29:00
3   2015-11-10 01:23:00
4   2015-11-10 01:17:00
Name: Date, dtype: datetime64[ns]

In [85]:
time.dtype

dtype('<M8[ns]')

In [86]:
df_sio['Date'] = time

In [87]:
df_sio.head()

                 Date  chl (ug/L)  pres (dbar)  sal (PSU)  temp (C)
0 2015-11-10 01:42:00      22.307        3.712     33.199     19.95
1 2015-11-10 01:35:00      22.311        3.588     33.201     19.94
2 2015-11-10 01:29:00      22.305        3.541     33.200     19.95
3 2015-11-10 01:23:00      22.323        3.463     33.200     19.95
4 2015-11-10 01:17:00      22.316        3.471     33.199     19.95

In [88]:
df_sio.dtypes

Date           datetime64[ns]
chl (ug/L)            float64
pres (dbar)           float64
sal (PSU)             float64
temp (C)              float64
dtype: object

In [89]:
df_sio4 = pd.read_csv('scripps_pier_20151110.csv', index_col=None,
                      parse_dates=['Date'])

In [90]:
df_sio4.head()

                 Date  chl (ug/L)  pres (dbar)  sal (PSU)  temp (C)
0 2015-11-10 01:42:00      22.307        3.712     33.199     19.95
1 2015-11-10 01:35:00      22.311        3.588     33.201     19.94
2 2015-11-10 01:29:00      22.305        3.541     33.200     19.95
3 2015-11-10 01:23:00      22.323        3.463     33.200     19.95
4 2015-11-10 01:17:00      22.316        3.471     33.199     19.95

In [91]:
df_sio4.dtypes

Date           datetime64[ns]
chl (ug/L)            float64
pres (dbar)           float64
sal (PSU)             float64
temp (C)              float64
dtype: object

In [92]:
# for maximal control, this can be combined with dtype
df_sio5 = pd.read_csv('scripps_pier_20151110.csv', index_col=None,
                      parse_dates=['Date'], dtype={'temp (C)': str}).head()

In [93]:
df_sio5.head()

                 Date  chl (ug/L)  pres (dbar)  sal (PSU) temp (C)
0 2015-11-10 01:42:00      22.307        3.712     33.199    19.95
1 2015-11-10 01:35:00      22.311        3.588     33.201    19.94
2 2015-11-10 01:29:00      22.305        3.541     33.200    19.95
3 2015-11-10 01:23:00      22.323        3.463     33.200    19.95
4 2015-11-10 01:17:00      22.316        3.471     33.199    19.95

In [94]:
df_sio5.dtypes

Date           datetime64[ns]
chl (ug/L)            float64
pres (dbar)           float64
sal (PSU)             float64
temp (C)               object
dtype: object